content/en/blog/building-this-site.org
#+TITLE: Building this Site
#+SUBTITLE: Richard Davis, Blog
#+AUTHOR: Richard Davis
#+DATE: <2023-12-07 Thu>
#+SETUPFILE: ../../../common/theme-readtheorg.setup

#+INCLUDE: ../../../common/header-en.org

Salutations!

I'm a nerd.
One of the things I'm a nerd about is Emacs, the extensible text editor.
Emacs does basically everything for me: I can listen to music, browse the web, read and send email, chat over multiple protocols, read and write PDF documents, etc.
(Notice that I didn't even explicitly mention writing text!)
One new thing that I have made Emacs do for me is build this website.
This proved harder than I expected, so I'll share some takeaways from the process.

* Hosting

This is pretty easy; I just use [[https://pages.github.com/][GitHub Pages]].
This also takes care of building the website via a [[https://docs.github.com/en/actions][GitHub Action]] that installs Emacs, builds the site, and publishes its content to GitHub Pages.
And though not technically necessary, I bought a domain and set it up as directed [[https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site][here]].

This part of the process is practically effortless, and I can recommend it to anyone looking to build a static site like this one.
I may someday want to migrate to a freer option like [[https://sr.ht/][sr.ht]] or [[https://codeberg.org/][Codeberg]] but that can wait until I have the money, time, and energy to do so.

* Building the site

The build process that GitHub Actions runs to build the site's HTML files is the publishing feature of [[https://orgmode.org/][Org Mode]], the incredibly powerful outlining tool/organizer/document builder etc. for Emacs.
This feature transforms files into other formats according user-defined project settings.
I am of course not the first to do this; my work draws on or steals from many who have done similar things before me.
My primary source was David Wilson of SystemCrafters fame, who has two excellent tutorials on [[https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/][building sites with Org Mode]] and [[https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/][automated publishing with GitHub Pages]].

As there are already excellent sources on these topics, I will summarize briefly and only comment on when I feel I do something differently or have something to offer.

* Setupfile

One thing I do (due to my lack of knowledge of HTML and CSS) is that I use a =setupfile= to provide nice HTML and CSS theming that I couldn't otherwise do myself.
At the moment I'm using the ReadTheOrg theme (a ReadTheDocs clone) from the wonderful [[https://github.com/fniessen/org-html-themes][=org-html-themes=]] project.
These can be added to your project with a =#+SETUPFILE:= directive in all Org Mode files, like so:

#+begin_src org
,#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+end_src

However, I require a few more settings, so I don't directly; I instead wrap this directive in my own =setupfile= which I then use in the org files for the website.
I override or add some HTML settings and define the =yt= macro to embed videos.
The =setupfile= looks something like this:
#+begin_src org
# include the original setupfile
,#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

# my settings
,#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="/images/favicon.ico">
,#+HTML_HEAD: <script type="text/javascript" src="https://payhip.com/payhip.js"></script>

,#+MACRO: yt (eval (concat "#+begin_export html\n" "<div class=\"video\">" "  <iframe src=\"https://www.youtube-nocookie.com/embed/" $1 "\" allowfullscreen></iframe>" "</div>\n" "#+end_export"))

,#+HTML_HEAD: <style> #content{max-width:1800px;}</style>
,#+HTML_HEAD: <style> p{max-width:800px;}</style>
,#+HTML_HEAD: <style> li{max-width:800px;}</style
#+end_src
I refer to the setupfile from within org files like so:
#+begin_src org
,#+SETUPFILE: ../path/to/my/theme-readtheorg.setup
#+end_src

In order to allow downloading the remote setupfile, in the publish script, I must include it in the variable =org-safe-remote-resources=:
#+begin_src emacs-lisp
(setq org-safe-remote-resources
      '("\\`https://fniessen\\.github\\.io/org-html-themes/org/theme-readtheorg\\.setup\\'"))
#+end_src

* Blog

The hardest part of this site was setting up the blog the way I wanted it.
I relied a lot on [[https://writepermission.com/org-blogging-rss-feed.html][this wonderful article]] to help me generate the RSS feed, though I had to tweak some functions to get it to function as I like it.

