en/blog/building-this-site.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-04-03 Wed 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building this Site</title>
<meta name="author" content="Richard Davis" />
<meta name="generator" content="Org Mode" />
<link href="/styles/org.css" rel="stylesheet" />
<link href="/styles/style.css" rel="stylesheet" />
<link href="https://fonts.googleapis.com/css?family=JetBrains+Mono&?family=Open+Sans" rel="stylesheet" />
<link rel="alternate" type="application/rss+xml" title="Blog RSS Feed" href="/en/blog/rss.xml">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Building this Site
<br />
<span class="subtitle">Richard Davis, Blog</span>
</h1>
<div class="org-center">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="../index.html">Home</a></td>
<td class="org-left"><a href="../about.html">About</a></td>
<td class="org-left"><a href="../events.html">Events</a></td>
<td class="org-left"><a href="../listening.html">Listening</a></td>
<td class="org-left"><a href="index.html">Blog</a></td>
<td class="org-left"><a href="../../fr/index.html">FR</a></td>
</tr>
</tbody>
</table>
</div>

<p>
Salutations!
</p>

<p>
I'm a nerd.
One of the things I'm a nerd about is Emacs, the extensible text editor.
Emacs does basically everything for me: I can listen to music, browse the web, read and send email, chat over multiple protocols, read and write PDF documents, etc.
(Notice that I didn't even explicitly mention writing text!)
One new thing that I have made Emacs do for me is build this website.
This proved harder than I expected, so I'll share some takeaways from the process.
</p>

<div id="outline-container-orgbe040c4" class="outline-2">
<h2 id="orgbe040c4">Hosting</h2>
<div class="outline-text-2" id="text-orgbe040c4">
<p>
This is pretty easy; I just use <a href="https://pages.github.com/">GitHub Pages</a>.
This also takes care of building the website via a <a href="https://docs.github.com/en/actions">GitHub Action</a> that installs Emacs, builds the site, and publishes its content to GitHub Pages.
And though not technically necessary, I bought a domain and set it up as directed <a href="https://docs.github.com/en/pages/configuring-a-custom-domain-for-your-github-pages-site/managing-a-custom-domain-for-your-github-pages-site">here</a>.
</p>

<p>
This part of the process is practically effortless, and I can recommend it to anyone looking to build a static site like this one.
I may someday want to migrate to a freer option like <a href="https://sr.ht/">sr.ht</a> or <a href="https://codeberg.org/">Codeberg</a> but that can wait until I have the money, time, and energy to do so.
</p>
</div>
</div>

<div id="outline-container-orgd6e3431" class="outline-2">
<h2 id="orgd6e3431">Building the site</h2>
<div class="outline-text-2" id="text-orgd6e3431">
<p>
The build process that GitHub Actions runs to build the site's HTML files is the publishing feature of <a href="https://orgmode.org/">Org Mode</a>, the incredibly powerful outlining tool/organizer/document builder etc. for Emacs.
This feature transforms files into other formats according user-defined project settings.
I am of course not the first to do this; my work draws on or steals from many who have done similar things before me.
My primary source was David Wilson of SystemCrafters fame, who has two excellent tutorials on <a href="https://systemcrafters.net/publishing-websites-with-org-mode/building-the-site/">building sites with Org Mode</a> and <a href="https://systemcrafters.net/publishing-websites-with-org-mode/automated-site-publishing/">automated publishing with GitHub Pages</a>.
</p>

<p>
As there are already excellent sources on these topics, I will summarize briefly and only comment on when I feel I do something differently or have something to offer.
</p>
</div>
</div>

<div id="outline-container-org22a61c9" class="outline-2">
<h2 id="org22a61c9">Setupfile</h2>
<div class="outline-text-2" id="text-org22a61c9">
<p>
One thing I do (due to my lack of knowledge of HTML and CSS) is that I use a <code>setupfile</code> to provide nice HTML and CSS theming that I couldn't otherwise do myself.
At the moment I'm using the ReadTheOrg theme (a ReadTheDocs clone) from the wonderful <a href="https://github.com/fniessen/org-html-themes"><code>org-html-themes</code></a> project.
These can be added to your project with a <code>#+SETUPFILE:</code> directive in all Org Mode files, like so:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+SETUPFILE: <a href="https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup">https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup</a></span>
</pre>
</div>

<p>
However, I require a few more settings, so I don't directly; I instead wrap this directive in my own <code>setupfile</code> which I then use in the org files for the website.
I override or add some HTML settings and define the <code>yt</code> macro to embed videos.
The <code>setupfile</code> looks something like this:
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-comment"># include the original setupfile</span>
<span class="org-org-meta-line">#+SETUPFILE: <a href="https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup">https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup</a></span>

<span class="org-comment"># my settings</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;link rel="icon" type="image/x-icon" href="/images/favicon.ico"&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;script type="text/javascript" src="<a href="https://payhip.com/payhip.js">https://payhip.com/payhip.js</a>"&gt;&lt;/script&gt;</span>

<span class="org-org-meta-line">#+MACRO: yt (eval (concat "#+begin_export html\n" "&lt;div class=\"video\"&gt;" "  &lt;iframe src=\"<a href="https://www.youtube-nocookie.com/embed/">https://www.youtube-nocookie.com/embed/</a>" $1 "\" allowfullscreen&gt;&lt;/iframe&gt;" "&lt;/div&gt;\n" "#+end_export"))</span>

<span class="org-org-meta-line">#+HTML_HEAD: &lt;style&gt; #content{max-width:1800px;}&lt;/style&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;style&gt; p{max-width:800px;}&lt;/style&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;style&gt; li{max-width:800px;}&lt;/style</span>
</pre>
</div>
<p>
I refer to the setupfile from within org files like so:
</p>
<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+SETUPFILE: ../path/to/my/theme-readtheorg.setup</span>
</pre>
</div>

<p>
In order to allow downloading the remote setupfile, in the publish script, I must include it in the variable <code>org-safe-remote-resources</code>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> org-safe-remote-resources
      '(<span class="org-string">"\\`</span><span class="org-string"><span class="org-constant">https://fniessen\\.github\\.io/org-html-themes/org/theme-readtheorg\\.setup\\</span></span><span class="org-string">'"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org202026e" class="outline-2">
<h2 id="org202026e">Blog</h2>
<div class="outline-text-2" id="text-org202026e">
<p>
The hardest part of this site was setting up the blog the way I wanted it.
I relied a lot on <a href="https://writepermission.com/org-blogging-rss-feed.html">this wonderful article</a> to help me generate the RSS feed, though I had to tweak some functions to get it to function as I like it.
</p>
</div>
