content/en/blog/building-this-site.org
** =my/format-rss-feed-entry=

This function generates an RSS entry in an intermediate =rss.org= file.
It functions by sanitizing the text of the blog post to a useful RSS description and inserting that in an Org Mode entry with the appropriate properties.

#+begin_src emacs-lisp
(defun my/format-rss-feed-entry (entry style project)
  "Format ENTRY for the RSS feed.
ENTRY is a file name.  STYLE is either 'list' or 'tree'.
PROJECT is the current project."
  (cond ((not (directory-name-p entry))
         (let* ((file (org-publish--expand-file-name entry project))
                (title (org-publish-find-title entry project))
                (date (format-time-string
                       "%Y-%m-%d"
                       (org-publish-find-date entry project)))
                (link (concat (file-name-sans-extension entry) ".html"))
                (text
                 (with-temp-buffer
                   (insert-file-contents file)
                   ; remove kewords and comments
                   ; remove everything after first heading
                   (shell-command-on-region
                    (point-min)
                    (point-max)
                    "sed -n -e '/^[[:space:]]*#/d' -e '1,/^*/p'"
                    nil
                    t)
                   ; remove first heading
                   (shell-command-on-region
                    (point-min)
                    (point-max)
                    "sed '/^\\*/d'"
                    nil
                    t)
                   (string-trim (buffer-string)))))
           (with-temp-buffer
             (org-mode) ; need to call `org-set-property'
             (insert (format "* [[file:%s][%s]]\n" file title))
             (org-set-property "RSS_PERMALINK" link)
             (org-set-property "RSS_TITLE" title)
             (org-set-property "PUBDATE" date)
             (goto-char (point-max))
             (insert text)
             (buffer-string))))
        ((eq style 'tree)
         ;; Return only last subdir.
         (file-name-nondirectory (directory-file-name entry)))
        (t entry)))
#+end_src


The most notable change here is that I significantly sanitize the text of the region with the =shell-command-on-region= directives.
I make sure only the text of the article before the first heading (the introduction) remains in the RSS description, and that no keywords (such as =#+SUBTITLE=) remain that might sully the output.

** Project

The final entry in =org-publish-project-alist= looks something like this:
#+begin_src emacs-lisp
(list "davisrichard437.github.io:rss"
      :base-directory "./content/en/blog"
      :base-extension "org"
      :recursive nil
      :exclude (regexp-opt '("rss.org" "index.org" "404.org"))
      :publishing-function 'my/org-rss-publish-to-rss
      :publishing-directory "./public/en/blog"
      :rss-extension "xml"
      :html-link-home "https://richarddavis.xyz/en/blog/"
      :html-link-use-abs-url t
      :html-link-org-files-as-html t
      :auto-sitemap t
      :sitemap-filename "rss.org"
      :sitemap-title "Richard Davis, Composer"
      :sitemap-style 'list
      :sitemap-sort-files 'anti-chronologically
      :sitemap-function #'my/format-rss-feed
      :sitemap-format-entry #'my/format-rss-feed-entry)
#+end_src

* Blog landing page

The above does a great job to generate an RSS feed, but I also want to generate a landing page where the blog entries are that can be accessible to the rest of the site.
This turned out to be a very similar process to the RSS feed, with only a few tweaks necessary to change the formatting as I wish.
The entry in =org-publish-project-alist= is similar, with only a few details changed.

#+begin_src emacs-lisp
(list "davisrichard437.github.io:blog"
      :base-directory "./content/en/blog"
      :base-extension "org"
      :publishing-directory "./public/en/blog"
      :recursive nil
      :exclude (regexp-opt '("rss.org"))
      :html-link-home "https://richarddavis.xyz/en/blog/"
      :html-link-use-abs-url t
      :html-link-org-files-as-html t
      :auto-sitemap t
      :sitemap-filename "index.org"
      :sitemap-title "Richard Davis, Composer"
      :sitemap-style 'list
      :sitemap-format-entry #'my/format-sitemap-entry
      :sitemap-function #'my/format-sitemap
      :sitemap-sort-files 'anti-chronologically
      :sitemap-file-entry-format "%t (%d)")
#+end_src

Notably, the format functions have changed from the RSS project as the formatting needs have changed.

** =my/format-sitemap-entry=

This function takes a single file within the =davisrichard437.github.io:blog= project (a single blog post) and transforms it into an unordered list entry.

#+begin_src emacs-lisp
(defun my/format-sitemap-entry (file style project)
  "Format ENTRY for the RSS feed.
FILE is a file name.  STYLE is either 'list' or 'tree'.
PROJECT is the current project."
  (let ((path (org-publish--expand-file-name file project))
        (title (org-publish-find-title file project))
        (date (format-time-string "%Y-%m-%d"
                                  (org-publish-find-date file project))))
    (format "- [[file:%s][%s (%s)]]\n"
            file
            title
            date)))
#+end_src

