en/blog/building-this-site.html

<div id="outline-container-org32a8e03" class="outline-3">
<h3 id="org32a8e03"><code>my/format-rss-feed-entry</code></h3>
<div class="outline-text-3" id="text-org32a8e03">
<p>
This function generates an RSS entry in an intermediate <code>rss.org</code> file.
It functions by sanitizing the text of the blog post to a useful RSS description and inserting that in an Org Mode entry with the appropriate properties.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/format-rss-feed-entry</span> (entry style project)
  <span class="org-doc">"Format ENTRY for the RSS feed.</span>
<span class="org-doc">ENTRY is a file name.  STYLE is either 'list' or 'tree'.</span>
<span class="org-doc">PROJECT is the current project."</span>
  (<span class="org-keyword">cond</span> ((not (directory-name-p entry))
         (<span class="org-keyword">let*</span> ((file (org-publish--expand-file-name entry project))
                (title (org-publish-find-title entry project))
                (date (format-time-string
                       <span class="org-string">"%Y-%m-%d"</span>
                       (org-publish-find-date entry project)))
                (link (concat (file-name-sans-extension entry) <span class="org-string">".html"</span>))
                (text
                 (<span class="org-keyword">with-temp-buffer</span>
                   (insert-file-contents file)
                   <span class="org-comment-delimiter">; </span><span class="org-comment">remove kewords and comments</span>
                   <span class="org-comment-delimiter">; </span><span class="org-comment">remove everything after first heading</span>
                   (shell-command-on-region
                    (point-min)
                    (point-max)
                    <span class="org-string">"sed -n -e '/^[[:space:]]*#/d' -e '1,/^*/p'"</span>
                    nil
                    t)
                   <span class="org-comment-delimiter">; </span><span class="org-comment">remove first heading</span>
                   (shell-command-on-region
                    (point-min)
                    (point-max)
                    <span class="org-string">"sed '/^\\*/d'"</span>
                    nil
                    t)
                   (string-trim (buffer-string)))))
           (<span class="org-keyword">with-temp-buffer</span>
             (org-mode) <span class="org-comment-delimiter">; </span><span class="org-comment">need to call `</span><span class="org-comment"><span class="org-constant">org-set-property</span></span><span class="org-comment">'</span>
             (insert (format <span class="org-string">"* [[file:%s][%s]]\n"</span> file title))
             (org-set-property <span class="org-string">"RSS_PERMALINK"</span> link)
             (org-set-property <span class="org-string">"RSS_TITLE"</span> title)
             (org-set-property <span class="org-string">"PUBDATE"</span> date)
             (goto-char (point-max))
             (insert text)
             (buffer-string))))
        ((eq style 'tree)
         <span class="org-comment-delimiter">;; </span><span class="org-comment">Return only last subdir.</span>
         (file-name-nondirectory (directory-file-name entry)))
        (t entry)))
</pre>
</div>


<p>
The most notable change here is that I significantly sanitize the text of the region with the <code>shell-command-on-region</code> directives.
I make sure only the text of the article before the first heading (the introduction) remains in the RSS description, and that no keywords (such as <code>#+SUBTITLE</code>) remain that might sully the output.
</p>
</div>
</div>

<div id="outline-container-orgeb29a25" class="outline-3">
<h3 id="orgeb29a25">Project</h3>
<div class="outline-text-3" id="text-orgeb29a25">
<p>
The final entry in <code>org-publish-project-alist</code> looks something like this:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(list <span class="org-string">"davisrichard437.github.io:rss"</span>
      <span class="org-builtin">:base-directory</span> <span class="org-string">"./content/en/blog"</span>
      <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
      <span class="org-builtin">:recursive</span> nil
      <span class="org-builtin">:exclude</span> (regexp-opt '(<span class="org-string">"rss.org"</span> <span class="org-string">"index.org"</span> <span class="org-string">"404.org"</span>))
      <span class="org-builtin">:publishing-function</span> 'my/org-rss-publish-to-rss
      <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./public/en/blog"</span>
      <span class="org-builtin">:rss-extension</span> <span class="org-string">"xml"</span>
      <span class="org-builtin">:html-link-home</span> <span class="org-string">"https://richarddavis.xyz/en/blog/"</span>
      <span class="org-builtin">:html-link-use-abs-url</span> t
      <span class="org-builtin">:html-link-org-files-as-html</span> t
      <span class="org-builtin">:auto-sitemap</span> t
      <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"rss.org"</span>
      <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Richard Davis, Composer"</span>
      <span class="org-builtin">:sitemap-style</span> 'list
      <span class="org-builtin">:sitemap-sort-files</span> 'anti-chronologically
      <span class="org-builtin">:sitemap-function</span> #'my/format-rss-feed
      <span class="org-builtin">:sitemap-format-entry</span> #'my/format-rss-feed-entry)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22d3303" class="outline-2">
<h2 id="org22d3303">Blog landing page</h2>
<div class="outline-text-2" id="text-org22d3303">
<p>
The above does a great job to generate an RSS feed, but I also want to generate a landing page where the blog entries are that can be accessible to the rest of the site.
This turned out to be a very similar process to the RSS feed, with only a few tweaks necessary to change the formatting as I wish.
The entry in <code>org-publish-project-alist</code> is similar, with only a few details changed.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(list <span class="org-string">"davisrichard437.github.io:blog"</span>
      <span class="org-builtin">:base-directory</span> <span class="org-string">"./content/en/blog"</span>
      <span class="org-builtin">:base-extension</span> <span class="org-string">"org"</span>
      <span class="org-builtin">:publishing-directory</span> <span class="org-string">"./public/en/blog"</span>
      <span class="org-builtin">:recursive</span> nil
      <span class="org-builtin">:exclude</span> (regexp-opt '(<span class="org-string">"rss.org"</span>))
      <span class="org-builtin">:html-link-home</span> <span class="org-string">"https://richarddavis.xyz/en/blog/"</span>
      <span class="org-builtin">:html-link-use-abs-url</span> t
      <span class="org-builtin">:html-link-org-files-as-html</span> t
      <span class="org-builtin">:auto-sitemap</span> t
      <span class="org-builtin">:sitemap-filename</span> <span class="org-string">"index.org"</span>
      <span class="org-builtin">:sitemap-title</span> <span class="org-string">"Richard Davis, Composer"</span>
      <span class="org-builtin">:sitemap-style</span> 'list
      <span class="org-builtin">:sitemap-format-entry</span> #'my/format-sitemap-entry
      <span class="org-builtin">:sitemap-function</span> #'my/format-sitemap
      <span class="org-builtin">:sitemap-sort-files</span> 'anti-chronologically
      <span class="org-builtin">:sitemap-file-entry-format</span> <span class="org-string">"%t (%d)"</span>)
</pre>
</div>

<p>
Notably, the format functions have changed from the RSS project as the formatting needs have changed.
</p>
</div>

<div id="outline-container-org7459d29" class="outline-3">
<h3 id="org7459d29"><code>my/format-sitemap-entry</code></h3>
<div class="outline-text-3" id="text-org7459d29">
<p>
This function takes a single file within the <code>davisrichard437.github.io:blog</code> project (a single blog post) and transforms it into an unordered list entry.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/format-sitemap-entry</span> (file style project)
  <span class="org-doc">"Format ENTRY for the RSS feed.</span>
<span class="org-doc">FILE is a file name.  STYLE is either 'list' or 'tree'.</span>
<span class="org-doc">PROJECT is the current project."</span>
  (<span class="org-keyword">let</span> ((path (org-publish--expand-file-name file project))
        (title (org-publish-find-title file project))
        (date (format-time-string <span class="org-string">"%Y-%m-%d"</span>
                                  (org-publish-find-date file project))))
    (format <span class="org-string">"- [[file:%s][%s (%s)]]\n"</span>
            file
            title
            date)))
</pre>
</div>
</div>
</div>
