content/en/blog/building-this-site.org
** =my/format-sitemap=

This function formats the sitemap (in an intermediate file, =index.org=, that will subsequently be published to HTML) by adding all of the in-buffer settings and preamble text I want.

#+begin_src emacs-lisp
(defun my/format-sitemap (title list)
  "Generate sitemap, as a string.
TITLE is the title of the RSS feed.  LIST is an internal
representation for the files to include, as returned by
`org-list-to-lisp'."
  (concat "#+TITLE: " title "\n"
          "#+SUBTITLE: Blog\n"
          "#+AUTHOR: " user-full-name "\n"
          "#+SETUPFILE: ../../../common/theme-readtheorg.setup\n\n"
          "#+INCLUDE: ../../../common/header-en.org\n\n"
          "Subscribe to the RSS feed [[file:./rss.xml][here]]!\n\n"
          (org-list-to-subtree list 1 '(:icount "" :istart ""))))
#+end_src

* Quality of life

Beyond the above, I have made a few quality of life improvements that help me develop the site better.

** Publish script

The =publish.el= file at the root of the repository is itself a script, that defines Emacs as its interpreter with a shebang, as follows:

#+begin_src text
#!/usr/bin/env -S emacs -Q --script
#+end_src

This means the file can be run in any interactive shell like any other script.

#+begin_src shell
./publish.el
#+end_src

Another major advantage this offers is that it ensures the script can run on its own, without contamination from a local Emacs configuration.
This is essential for it to be able to run via a GitHub Action.

** Local development

One thing I found when doing local development is that =org-publish= will not remove published files if their source file has been removed.
This can make it a little challenging to know what will actually show when I push the repository.
Thus, before running =org-publish-all=, I make sure to delete the =public= directory:

#+begin_src emacs-lisp
(delete-directory "./public" t)
#+end_src

The intermediate files for the RSS feed and the sitemap can also get in the way, so I remove those too:

#+begin_src emacs-lisp
(setq regen-files '("content/en/blog/index.org"
                    "content/en/blog/rss.org"))

(dolist (f regen-files)
  (delete-file f))
#+end_src

This way I have a clean repository before publishing.

** =simple-httpd=

I like to use the [[https://github.com/snadjperge/simple-httpd][=simple-httpd=]] package to test the website as I build it.
Once it's installed, I publish the site once and run =M-x httpd-serve-directory RET path/to/public=.
I can then access the site from my web browser of choice by navigating to http://0.0.0.0:8080, or whatever URL shows up in the message buffer.
When I'm done I can run =M-x httpd-stop=.

* Conclusion

Emacs is pretty cool!
This setup works pretty well for me and it makes it much easier for me to maintain a website.
All I need at this point is to figure out how to get a good mono-space font for code examples.

You can access the source for this website [[https://github.com/davisrichard437/davisrichard437.github.io][here]].
Comments, suggestions, questions, etc. are always welcome at [[mailto:davisrichard437@gmail.com][davisrichard437@gmail.com]]!
