en/blog/building-this-site.html

<div id="outline-container-orgfc400af" class="outline-3">
<h3 id="orgfc400af"><code>my/format-sitemap</code></h3>
<div class="outline-text-3" id="text-orgfc400af">
<p>
This function formats the sitemap (in an intermediate file, <code>index.org</code>, that will subsequently be published to HTML) by adding all of the in-buffer settings and preamble text I want.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">my/format-sitemap</span> (title list)
  <span class="org-doc">"Generate sitemap, as a string.</span>
<span class="org-doc">TITLE is the title of the RSS feed.  LIST is an internal</span>
<span class="org-doc">representation for the files to include, as returned by</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">org-list-to-lisp</span></span><span class="org-doc">'."</span>
  (concat <span class="org-string">"#+TITLE: "</span> title <span class="org-string">"\n"</span>
          <span class="org-string">"#+SUBTITLE: Blog\n"</span>
          <span class="org-string">"#+AUTHOR: "</span> user-full-name <span class="org-string">"\n"</span>
          <span class="org-string">"#+SETUPFILE: ../../../common/theme-readtheorg.setup\n\n"</span>
          <span class="org-string">"#+INCLUDE: ../../../common/header-en.org\n\n"</span>
          <span class="org-string">"Subscribe to the RSS feed [[file:./rss.xml][here]]!\n\n"</span>
          (org-list-to-subtree list 1 '(<span class="org-builtin">:icount</span> <span class="org-string">""</span> <span class="org-builtin">:istart</span> <span class="org-string">""</span>))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org5011660" class="outline-2">
<h2 id="org5011660">Quality of life</h2>
<div class="outline-text-2" id="text-org5011660">
<p>
Beyond the above, I have made a few quality of life improvements that help me develop the site better.
</p>
</div>

<div id="outline-container-orgf798943" class="outline-3">
<h3 id="orgf798943">Publish script</h3>
<div class="outline-text-3" id="text-orgf798943">
<p>
The <code>publish.el</code> file at the root of the repository is itself a script, that defines Emacs as its interpreter with a shebang, as follows:
</p>

<div class="org-src-container">
<pre class="src src-text">#!/usr/bin/env -S emacs -Q --script
</pre>
</div>

<p>
This means the file can be run in any interactive shell like any other script.
</p>

<div class="org-src-container">
<pre class="src src-shell">./publish.el
</pre>
</div>

<p>
Another major advantage this offers is that it ensures the script can run on its own, without contamination from a local Emacs configuration.
This is essential for it to be able to run via a GitHub Action.
</p>
</div>
</div>

<div id="outline-container-orgb858848" class="outline-3">
<h3 id="orgb858848">Local development</h3>
<div class="outline-text-3" id="text-orgb858848">
<p>
One thing I found when doing local development is that <code>org-publish</code> will not remove published files if their source file has been removed.
This can make it a little challenging to know what will actually show when I push the repository.
Thus, before running <code>org-publish-all</code>, I make sure to delete the <code>public</code> directory:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(delete-directory <span class="org-string">"./public"</span> t)
</pre>
</div>

<p>
The intermediate files for the RSS feed and the sitemap can also get in the way, so I remove those too:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">setq</span> regen-files '(<span class="org-string">"content/en/blog/index.org"</span>
                    <span class="org-string">"content/en/blog/rss.org"</span>))

(<span class="org-keyword">dolist</span> (f regen-files)
  (delete-file f))
</pre>
</div>

<p>
This way I have a clean repository before publishing.
</p>
</div>
</div>

<div id="outline-container-orga433d44" class="outline-3">
<h3 id="orga433d44"><code>simple-httpd</code></h3>
<div class="outline-text-3" id="text-orga433d44">
<p>
I like to use the <a href="https://github.com/snadjperge/simple-httpd"><code>simple-httpd</code></a> package to test the website as I build it.
Once it's installed, I publish the site once and run <code>M-x httpd-serve-directory RET path/to/public</code>.
I can then access the site from my web browser of choice by navigating to <a href="http://0.0.0.0:8080">http://0.0.0.0:8080</a>, or whatever URL shows up in the message buffer.
When I'm done I can run <code>M-x httpd-stop</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-org329a0a5" class="outline-2">
<h2 id="org329a0a5">Conclusion</h2>
<div class="outline-text-2" id="text-org329a0a5">
<p>
Emacs is pretty cool!
This setup works pretty well for me and it makes it much easier for me to maintain a website.
All I need at this point is to figure out how to get a good mono-space font for code examples.
</p>

<p>
You can access the source for this website <a href="https://github.com/davisrichard437/davisrichard437.github.io">here</a>.
Comments, suggestions, questions, etc. are always welcome at <a href="mailto:davisrichard437@gmail.com">davisrichard437@gmail.com</a>!
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="copyright">© Richard Davis, 2024-04-03 Wed 13:14</p>
</div>
</body>
</html>
